CSI API ETABS v1
cAreaObj.SetSpringAssignment Method
 Assigns an existing named area spring property to area objects
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSpringAssignment(
	string Name,
	string SpringProp,
	eItemType ItemType = eItemType.Objects
)
Function SetSpringAssignment (
	Name As String,
	SpringProp As String,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim SpringProp As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetSpringAssignment(Name,
	SpringProp, ItemType)
int SetSpringAssignment(
	String^ Name,
	String^ SpringProp,
	eItemType ItemType = eItemType::Objects
)
abstract SetSpringAssignment :
        Name : string *
        SpringProp : string *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing area object or group depending on the value of the ItemType item.
SpringProp
Type: System.String
 The name of an existing area spring property
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the property assignment is made to the area object specified by the Name item.
 If this item is Group, the property assignment is made to all area objects in the group specified by the Name item.
 If this item is SelectedObjects, the property assignment is made to all selected area objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the property is successfully assigned, otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim SpringProp As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
   ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new spring property
   ret = SapModel.PropAreaSpring.SetAreaSpringProp("mySpringProp1", 0, 0, 100, 0)
'assign property
   ret = SapModel.AreaObj.SetSpringAssignment("1", "mySpringProp1")
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace